[
    {
        "title":"Graduate Researcher",
        "position":"Graduate Researcher",
        "employer":"National Institute of Standards and Technology",
        "start":"2017-8-15",
        "stop":"2021-12-20",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Measuring LTE and 5G devices and developing algorithms for the detection of anomalies in communications systems.",
            "Developed measurement techniques a python software suite for automated wide-band wireless virtual array measurements and analysis with the NIST SAMURAI system.",
            "Learned established measurement tools, techniques, and calibrations for providing traceable measurements."
        ]
    },
    {
        "title":"PhD Candidate",
        "position":"PhD Candidate",
        "employer":"Colorado School of Mines",
        "start":"2017-8-15",
        "stop":"2021-12-20",
        "city":"Golden",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Researching the usage of Monte Carlo techniques to improve channel estimation for 5G millimeter-wave wireless communication systems",
            "Developed and verified software to simulate hardware and large-scale phased arrays in measured propagation environments to evaluate channel estimators in 5G millimeter-Wave communications systems.",
            "Accelerated simulations of phased array hardware and electromagnetic simulations with multiple CPUs and GPUs using python, C, and CUDA."
        ]
    },
    {
        "title":"Undergraduate Research Assistant",
        "position":"Undergraduate Research Assistant",
        "employer":"University of Colorado",
        "start":"2014-8-15",
        "stop":"2017-5-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Simulated electromagnetic propagation using finite difference time domain (FDTD) algorithms, including high-order algorithms for improved accuracy.",
            "Implemented electromagnetic simulations using FDTD on GPUs and a supercomputer using FORTRAN, C, CUDA and MPI with SLURM.",
            "Integrated complex CAD models into electromagnetic simulations using high-order algorithms by leveraging existing software."
        ]
    },
    {
        "title":"Summer Intern",
        "position":"Summer Intern",
        "employer":"United Launch Alliance",
        "start":"2015-5-15",
        "stop":"2016-8-15",
        "city":"Centennial",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Helped coordinate the development of spaceflight subsystems for future human space launch systems",
            "Worked with a team to analyze accidents and errors that occurred during the construction and launch of aerospace systems.",
            "Advancing professional skills and experience by solving problems teams of engineers from various backgrounds"
        ]
    },
    {
        "title":"Teaching Assistant",
        "position":"Teaching Assistant",
        "employer":"University of Colorado",
        "start":"2015-8-15",
        "stop":"2016-5-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Worked with new students to design and build open ended engineering design projects to help in the local community.",
            "Mentored student's professional skills and design experience to help them get started in their college careers as engineering students."
        ]
    },
    {
        "title":"Rocket Sat X EPS Team Member",
        "position":"Rocket Sat X EPS Team Member",
        "employer":"Colorado Space Grant Consortium",
        "start":"2014-1-15",
        "stop":"2014-8-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Developed an electronic system to inductively melt aluminum in under a minute.",
            "Manufactured PCBs and circuit peripherals to track and store sensor measurements from the system."
        ]
    },
    {
        "title":"Sales Associate",
        "position":"Sales Associate",
        "employer":"Merrell Shoes",
        "start":"2013-6-15",
        "stop":"2014-8-15",
        "city":"Centennial",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Assisted customers in finding shoes that matched their applications."
        ]
    }
]