[
    {
        "title":"Graduate Researcher",
        "position":"Graduate Researcher",
        "employer":"National Institute of Standards and Technology",
        "start":"2017-8-15",
        "stop":"2021-12-20",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Creating new measurement and verification techniques with LTE and 5G devices for the detection of anomalies in communications systems.",
            "Developed software and measurement techniques for wideband wireless virtual array measurements with the NIST SAMURAI system.",
            "learned established measurement tools, techniques, and calibrations from experts with hands-on instruction."
        ]
    },
    {
        "title":"PhD Candidate",
        "position":"PhD Candidate",
        "employer":"Colorado School of Mines",
        "start":"2017-8-15",
        "stop":"2021-12-20",
        "city":"Golden",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Researching the usage of Monte Carlo techniques to improve channel estimation for fifth-generation millimeter-wave wireless communication systems",
            "Developed and verified software to simulate RF hardware in large-scale phased arrays and measured wireless propagation channels to evaluate channel estimators in 5G Millimeter-Wave communications systems.",
            "Accelerated simulations of RF hardware and electromagnetic simulations using multiple GPUs and distributed computing systems."
        ]
    },
    {
        "title":"Summer Intern",
        "position":"Summer Intern",
        "employer":"United Launch Alliance",
        "start":"2015-5-15",
        "stop":"2016-8-15",
        "city":"Centennial",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Helped coordinate the development of tools for future human space launch systems",
            "Worked with a team to analyze accidents and errors that occurred during the construction and launch of aerospace systems.",
            "Advancing professional skills and experience working with teams of engineers from various backgrounds"
        ]
    },
    {
        "title":"Undergraduate Research Assistant",
        "position":"Undergraduate Research Assistant",
        "employer":"University of Colorado",
        "start":"2014-8-15",
        "stop":"2017-5-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Simulated electromagnetic propagation with a high-order finite difference time domain (FDTD) algorithm.",
            "Implemented electromagnetic simulations on GPUs and a supercomputer using CUDA and MPI.",
            "Developed methods for integrating high-order algorithms and complex CAD models into existing simulation software."
        ]
    },
    {
        "title":"Teaching Assistant",
        "position":"Teaching Assistant",
        "employer":"University of Colorado",
        "start":"2015-8-15",
        "stop":"2016-5-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Worked with new students on open ended engineering design projects to better the local community.",
            "Mentored student's professional skills and design experience to help them get started in their college careers as engineering students."
        ]
    },
    {
        "title":"Rocket Sat X EPS Team Member",
        "position":"Rocket Sat X EPS Team Member",
        "employer":"Colorado Space Grant Consortium",
        "start":"2014-1-15",
        "stop":"2014-8-15",
        "city":"Boulder",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Developed an electronic system to inductively melt aluminum in under a minute.",
            "Manufactured PCBs and circuit peripherals to track and store sensor measurements from the system."
        ]
    },
    {
        "title":"Sales Associate",
        "position":"Sales Associate",
        "employer":"Merrell Shoes",
        "start":"2013-6-15",
        "stop":"2014-8-15",
        "city":"Centennial",
        "state":"Colorado",
        "country":"USA",
        "comments":[
            "Assisted customers in finding shoes that matched their applications."
        ]
    }
]